CSI API ETABS v1
cDetailing.GetBeamLongRebarData Method
 Retrieves longitudinal rebar data for a beam frame object
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetBeamLongRebarData(
	string Name,
	ref int NumberRebarSets,
	ref string[] BarSizeName,
	ref double[] BarArea,
	ref int[] NumberBars,
	ref string[] Location,
	ref double[] ClearCover,
	ref double[] StartCoord1,
	ref double[] BarLength,
	ref double[] BendingAngleStart,
	ref double[] BendingAngleEnd,
	ref string[] RebarSetGUID
)
Function GetBeamLongRebarData (
	Name As String,
	ByRef NumberRebarSets As Integer,
	ByRef BarSizeName As String(),
	ByRef BarArea As Double(),
	ByRef NumberBars As Integer(),
	ByRef Location As String(),
	ByRef ClearCover As Double(),
	ByRef StartCoord1 As Double(),
	ByRef BarLength As Double(),
	ByRef BendingAngleStart As Double(),
	ByRef BendingAngleEnd As Double(),
	ByRef RebarSetGUID As String()
) As Integer
Dim instance As cDetailing
Dim Name As String
Dim NumberRebarSets As Integer
Dim BarSizeName As String()
Dim BarArea As Double()
Dim NumberBars As Integer()
Dim Location As String()
Dim ClearCover As Double()
Dim StartCoord1 As Double()
Dim BarLength As Double()
Dim BendingAngleStart As Double()
Dim BendingAngleEnd As Double()
Dim RebarSetGUID As String()
Dim returnValue As Integer
returnValue = instance.GetBeamLongRebarData(Name,
	NumberRebarSets, BarSizeName, BarArea,
	NumberBars, Location, ClearCover,
	StartCoord1, BarLength, BendingAngleStart,
	BendingAngleEnd, RebarSetGUID)
int GetBeamLongRebarData(
	String^ Name,
	int% NumberRebarSets,
	array<String^>^% BarSizeName,
	array<double>^% BarArea,
	array<int>^% NumberBars,
	array<String^>^% Location,
	array<double>^% ClearCover,
	array<double>^% StartCoord1,
	array<double>^% BarLength,
	array<double>^% BendingAngleStart,
	array<double>^% BendingAngleEnd,
	array<String^>^% RebarSetGUID
)
abstract GetBeamLongRebarData :
        Name : string *
        NumberRebarSets : int byref *
        BarSizeName : string[] byref *
        BarArea : float[] byref *
        NumberBars : int[] byref *
        Location : string[] byref *
        ClearCover : float[] byref *
        StartCoord1 : float[] byref *
        BarLength : float[] byref *
        BendingAngleStart : float[] byref *
        BendingAngleEnd : float[] byref *
        RebarSetGUID : string[] byref -> int
Parameters
Name
Type: System.String
 The name of an existing beam frame object
NumberRebarSets
Type: System.Int32
 Number of longitudinal rebar sets for this beam object
BarSizeName
Type: System.String[]
 Rebar designation
BarArea
Type: System.Double[]
 Individual rebar area
NumberBars
Type: System.Int32[]
 Number of rebars in this set
Location
Type: System.String[]
 Location of this set of rebars - A, B, C, etc. (See picture for seismic/ non-seismic detailing)
ClearCover
Type: System.Double[]
 Clear cover from top or bottom beam face to longitudinal rebar being specified
StartCoord1
Type: System.Double[]
 Start of this set of rebars from start/end (depends on location) of beam object
BarLength
Type: System.Double[]
 Length of bars from start point
BendingAngleStart
Type: System.Double[]
 Bend angle if any at start of rebars
BendingAngleEnd
Type: System.Double[]
 Bend angle if any at end of rebars
RebarSetGUID
Type: System.String[]
 The GUIDs of each of the rebar sets (could be duplicated for adjacent beam if rebars are continuous)
Return Value
Type: Int32
 Returns zero if the rebar data is successfully retrieved; otherwise it returns a nonzero value.
See Also
Reference
cDetailing Interface
ETABSv1 Namespace